//{===========================================================================
//! @file       Examples/ExampleYours/ExampleYours.cpp
//!
//! @brief      Ваш пример использования TXNetwork. Присылайте все на почту vova@txlib.ru.
//!
//!             Библиотека Сети Тупых Художников (TXNetwork).
//!
//!             $Copyright: (C) Ded (Ilya Dedinsky, http://txlib.ru) <mail@txlib.ru> $
//}===========================================================================

// Тут может быть ваш пример:) Присылайте все на почту vova@txlib.ru.

// Напиши здесь свой код! Стань настоящим джедаем TXNetwork'а и <s> утри нос Павлу Дурову,
// написав свой Telegram.</s> Шутка, настоящий Telegram не так уж просто написать. Но ты
// можешь попытаться.

-----> Твой компилятор приветствует тебя сообщениями об ошибках в этой строке!  <-----
